# Creating & Accessing SQLite DB w/ Python

### First, what is SQLite?

SQLite is the most widely deployed SQL database engine in the world. </br>
It is self-contained, serverless, transactional, and requires zero-configuration

### Creating a database using SQLite

First, we'll need to import our dependancies and establish our connection

In [10]:
import sqlite3
conn = sqlite3.connect('INSTRUCTOR.db')

Here, we'll be creating our cursor.</br>
A Cursor is used to invoke methods which will execute SQLite statements as well as fetch data from result sets.

In [14]:
cursor_obj = conn.cursor()

### Creating a table

Before creating a table, let's check to see if the table alrady exists or not.

In [11]:
cursor_obj.execute('DROP TABLE IF EXISTS INSTRUCTOR')

In [13]:
# Creating table
table = """ create table IF NOT EXISTS 
INSTRUCTOR(ID INTEGER PRIMARY KEY NOT NULL, FNAME VARCHAR(20),
LNAME VARCHAR(20), CITY VARCHAR(20), CCODE CHAR(2));"""
 
cursor_obj.execute(table)
 
print("Table is Ready")

Table is Ready

### Inserting data into table

Let's start by inserting only our first row of data.

In [18]:
cursor_obj.execute('''insert into INSTRUCTOR values
(4, 'Rav', 'Ahuja', 'TORONTO', 'CA')''')

Now, let's insert the remaining two rows of data.

In [17]:
cursor_obj.execute('''insert into INSTRUCTOR values (2, 'Raul', 'Chong', 'Markham', 'CA'), 
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')''')

### Querying data from table

First, we'll fetch for all the rows in the table

In [19]:
statement = '''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(statement)

print("All the data")
output_all = cursor_obj.fetchall()
for row_all in output_all:
  print(row_all)

All the data
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')
(4, 'Rav', 'Ahuja', 'TORONTO', 'CA')

Now, let's only fetch a couple rows

In [25]:
# We will limit our result set using our cursor object instead of our query
statement = '''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(statement)
  
print("2 rows")
# If you want to fetch few rows from the table we use fetchmany(numberofrows) and mention the number how many rows you want to fetch
output_many = cursor_obj.fetchmany(2) 
for row_many in output_many:
  print(row_many)

2 rows
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')

Lastly, let's only fetch the FNAME column

In [26]:
# Fetch only FNAME from the table
# We will limit our result set using our query
statement = '''SELECT FNAME FROM INSTRUCTOR'''
cursor_obj.execute(statement)
  
print("All the data")
output_column = cursor_obj.fetchall()
for fetch in output_column:
  print(fetch)

All the data
('Rav',)
('Raul',)
('Hima',)
('Rav',)

### Loading our data into Pandas

In [28]:
import pandas as pd
df = pd.read_sql_query('select * from instructor;', conn)
df

   ID FNAME      LNAME     CITY CCODE
0   1   Rav      Ahuja  TORONTO    CA
1   2  Raul      Chong  Markham    CA
2   3  Hima  Vasudevan  Chicago    US
3   4   Rav      Ahuja  TORONTO    CA

### Lastly, we must close our connection.

In [29]:
conn.close()